import numpy as np
#重塑資料型態
data=np.zeros(18).reshape(3,2,3)
print(data)

data=np.arange(9).reshape(3,3)
print(data)


#資料的索引
data=np.array([2,4,6])
print(data[0]) #2
print(data[1]) #4
print(data[2]) #6

data=np.array([
    [1,4,2],
    [3,-1,10]
])
print(data[0,2]) #2
print(data[1,0]) #3

'''
資料切片語法: 多維陣列[起始索引:結束索引]
data[x:y] 從索引x 到索引 y-1 的值
data[x:]  從索引x 到最後的值
data[:y]  從低一個到索引 y-1值
data[:]   全部叫出來
'''
data=np.array([3,4,1,5])
data[0:2] #[3,4]
data[1:4] #[4,1,5]
data[2:]  #[1,5]
data[:3]  #[3,4,1]
data[:]   #[3,4,1,5]

#多維資料之索引
data=np.array([
    [3,1,2],[1,2,5],[5,2,2],[3,-5,1]
])
data[2:4,1:3] #第一層索引2:4 即[5,2,2],[3,-5,1] ，第二層索引1:3 即[5,2,2]的2,2 和[3,-5,1]的 -5,1
data[0:2,1]   #第一層索引0:2 即[3,1,2],[1,2,5]，第二層索引 1 即分別是兩個陣列的 1,2

#多維度資料的切片
#使用 '...' 代表我都要
data=np.array([
    [
        [3,1,2],[1,0,5]
    ],
    [
        [5,4,3],[1,3,-3]
    ]
])
data[1,...] #[[ 5  4  3],[ 1  3 -3]]，第一層要索引1 , 第二層全都要
data[...,0:2] #[[[3 1],[1 0]] , [[5 4],[1 3]]] 第一層全都要, 第二層取0:2

'''
## 每隔一個取元素，並從序號3(第四個)開始
x[3::2]

## 行的维度取四個，列的維度每隔一個取元素
d2 [:4, ::2]

## 獲取數組的第一列
print(d2[:, 0])
​
## 獲取數組的第四列
print (d2[:, 3])
'''